[
 {
   "Name as you'd like it to appear": "Fernanda Carvalho",
   "Title": "Hug Me Tight",
   "Materials": "Vinyl, recyclable polystyrene beans, wax thread",
   "Writing": "While we move towards a contactless generation, we also adapt our lives to contactless relationships. Hug Me Tight is an organic artificial intelligence that explores intimacy, trust, and the longing for touch.",
   "Social Media Link": "https://www.instagram.com/fernandacarvalhoart/",
   "Link to work": "https://drive.google.com/file/d/1yEix3YNnjp9ZEBkr2Zbs-jrgMmhaC1Dw/view?usp=sharing",
   "filename": "fernanda.jpg"
 },
 {
   "Name as you'd like it to appear": "Mackenzie Bumgarner ",
   "Title": "DREAMLAND",
   "Materials": "Cardboard, acrylic paint, paper lanterns, tulle, ployester fiber",
   "Writing": "With the state of the world being what it is right now, (confusing, messy, depressing, scary, disappointing, etc.) I think it’s pretty normal for people to want to escape to somewhere happier, more safe, more peaceful, and more enjoyable. A place of serenity. We even seek this out, sometimes without realizing, when we play video games, watch movies, listen to our favorite music, go to certain places, and the list goes on. I want to see art do this for people more, and for art to be even more accessible. That is the goal for this installation. \n\n\n\nI want people to see this and be transported into this fantasyland, even if it’s just for a split second. Life is difficult for everybody right now in some way or another, and people deserve to have these moments of serenity. Not only do I want this project to comfort people in this way, but I also want it to provoke people to think about what their escape looks like and how they define that for themselves. ",
   "Social Media Link": "",
   "Link to work": "https://drive.google.com/file/d/1e0vG4oqXN_tQRlMUKB3JyI_ZR7uyEOoy/view?usp=sharing",
   "filename": "mackenzie.jpg"
 },
 {
   "Name as you'd like it to appear": "Itzel Velazquez",
   "Title": "Mi Santuario ",
   "Materials": "Wood, pink foam, fabric, found objects",
   "Writing": "Mi Sanctuario is a piece based on the devotion to a huge religious/spiritual figure in Mexico, Our Lady of Guadalupe, la Reyna de Mexico, others recognize her as Tonantzin, the divine mother. In this installation, I want to create a space for others to come, reflect on themselves and their connection to the pieces in front of them. It is built so people can walk in and observe the feelings being invoked in hopes that they feel a spiritual connection and are allowed to meditate, manifest, and pray to her. I want to represent how important Guadalupe is to the Latinx community and most importantly to the Mexican community as she had protected, healed, and granted so much wealth and health to my community. ",
   "Social Media Link": "",
   "Link to work": "https://drive.google.com/file/d/1nE5wu4yaGGMNuLiWtJUztehA688ZkR3-/view?usp=sharing",
   "filename": "itzel.jpg"
 },
 {
   "Name as you'd like it to appear": "Olivia Jobbe",
   "Title": "The Kitschen",
   "Materials": "Mixed media",
   "Writing": "During the COVID era, the sense of community established through the communal preparation and sharing of a meal has been lost. Our mutual isolation causes a sorrowful loss of connection between one another. In this piece, I set out to represent the pre-COVID era joy of gathering around food, coupled with the somber reality of our current social state by creating an immersive sensory experience. The act of preparing a meal is kinesthetic. The sounds of cooking and communicating stimulate one auditorily. Ingredients emit an aroma and the ability to occupy the same space as your loved ones creates a feeling of togetherness. I’ve created a pseudo-family dinner by setting a table with seven chairs and hand painted plates featuring patterns that represent people close to me. Each setting includes a napkin monogrammed with the respective love one’s initials. The video and sound elements depict myself cooking my own comfort food: gravy and meatballs and then eating them around an empty table. Throughout, audio recordings taken from home videos of my own family cooking and eating are mixed into the sounds of my cooking and the silence of me eating in solitude. ",
   "Social Media Link": "",
   "Link to work": "https://drive.google.com/file/d/1VSEoCQK6cW1PdprbLQQJS5krg62-Fb8J/view?usp=sharing",
   "filename": "olivia.jpg"
 },
 {
   "Name as you'd like it to appear": "Owen Algrant",
   "Title": "Metropolitan Rescues D-Velour",
   "Materials": "Mixed media",
   "Writing": "D-Velour, captured only weeks prior to today for pirating precious cultural artifacts, has himself become a cultural artifact. You witness now the scene of his recapture, his rescue by the elusive Metropitan, a messenger whose destiny guides him through seemingly impenetrable obstacles...",
   "Social Media Link": "",
   "Link to work": "https://drive.google.com/file/d/1rYPpVLGGaXijCVOOtuPiD9KOkfSIzI7z/view?usp=sharing",
   "filename": "owen_final.jpg"
 },
 {
   "Name as you'd like it to appear": "Sofiya Lobanovich",
   "Title": "Не выноси сор из избы // Don’t wash your dirty linen in public",
   "Materials": "Air dry clay",
   "Writing": "<a href=\"../data/site-sight/Lobanovich_Не.pdf\" target=\"_blank\">read more</a>",
   "Social Media Link": "https://www.instagram.com/fineartecho",
   "Link to work": "https://drive.google.com/file/d/1KaOL9O62y-KePRTh09_gC7Z1wjVv_SxD/view?usp=sharing",
   "filename": "sofiya.jpg"
 },
 {
   "Name as you'd like it to appear": "Chana Goldbloom",
   "Title": "Are You Laughing?",
   "Materials": "Screws, silks, chiffon, found clothing, embroidery floss, surgical masks",
   "Writing": "",
   "Social Media Link": "https://www.chanagoldbloom.com/",
   "Link to work": "https://drive.google.com/file/d/1jqNV9kpOPrjM7um5fRJA17G88k5FhoGJ/view?usp=sharing",
   "filename": "chana.jpg"
 },
 {
   "Name as you'd like it to appear": "JRah",
   "Title": "Metal& Debris1",
   "Materials": "",
   "Writing": "",
   "Social Media Link": "",
   "Link to work": "https://drive.google.com/file/d/1t0ZEE6PVKANlcKsRreoiLMIEQ2rwt_qz/view?usp=sharing",
   "filename": "jrah.jpg"
 },
 {
   "Name as you'd like it to appear": "Araceli Zuniga",
   "Title": "PRIVATE",
   "Materials": "EVA foam tiles",
   "Writing": "",
   "Social Media Link": "https://www.sleeplesstransgressor.com/",
   "Link to work": "https://drive.google.com/file/d/1ommKAm7VH5uU8loIS3wc7WAlBA_kkz4I/view?usp=sharing",
   "filename": "araceli.jpg"
 },
 {
   "Name as you'd like it to appear": "Bhrigu",
   "Title": "God At Work (Anatomy of The Universe)",
   "Materials": "Found materials and mixed media",
   "Writing": "God At Work; Do not disturb, These abstract workings, Of the Universe, Sky, Earth and Mind. Anatomy of The Universe, In the midst of a shrine. It will remain, Till the end of time.               ",
   "Social Media Link": "",
   "Link to work": "https://drive.google.com/file/d/1lH6r_iJi2Jh_NKpJv_TJFgaO8xYkx5ln/view?usp=sharing",
   "filename": "brhigu.jpg"
 },
 {
   "Name as you'd like it to appear": "Brandon Paterno",
   "Title": "“The Hudson River averages around 3168 feet from one point to another,”",
   "Materials": "Mixed media",
   "Writing": "Even though we will be forever separated by time and distance, this will always be for you.",
   "Social Media Link": "https://vimeo.com/brandonpaterno",
   "Link to work": "https://drive.google.com/file/d/11-jR67D7jJkzFKswBe4g6195keJOZVO2/view?usp=sharing",
   "filename": "brandon.jpg"
 },
 {
   "Name as you'd like it to appear": "Emris Brandt",
   "Title": "Angel 1.0",
   "Materials": "Sheet metal, chainmail",
   "Writing": "Metal feels spiritual to me, ethereal and otherworldly. Metal is industrial, and technology is something that is meant to elevate us — let us transcend our physical limitations, or at the very least stretch them. Industrialization and industrial processes are not often seen as overtly spiritual or religious, but hold a lot of spiritual energy. Not only are these processes inherently meant to elevate humanity, but the time and energy we spend with technology becomes a form of worship. By imbuing the material with spiritual essense, I hope to suggest a futuristic and technological view of spiritual forms.",
   "Social Media Link": "http://8houseviz.com/",
   "Link to work": "https://drive.google.com/file/d/1zxP3BdOc3XM79xbCmUaqm5UDejiXugJe/view?usp=sharing",
   "filename": "emris.jpg"
 },
 {
   "Name as you'd like it to appear": "Mimi Ozormoor",
   "Title": "An Ode to the Small Artist",
   "Materials": "Mixed media",
   "Writing": "A reminder to all the creatives who pass by here that even when it seems like your art can't be seen, everything that you do has worth. Instagram: @mang.oh.no",
   "Social Media Link": "https://www.instagram.commang.oh.no",
   "Link to work": "https://drive.google.com/file/d/1nVJJe0hWFxGVFGNa5DBMFLzQi-GisAlv/view?usp=sharing",
   "filename": "mimi.jpg"
 },
 {
   "Name as you'd like it to appear": "Audrey Hirschman",
   "Title": "Secret Radio",
   "Materials": "Electromagnetic microphone, microphone stand, clock radio, guitar amplifier, 1/4 inch cable",
   "Writing": "Secret Radio explores the internal and external sonic spaces of a clock radio. While the outside of the clock radio clearly blares music, the internal space is defined by the electromagnetic field that the device emits. This installation seeks to ask of the viewer what spaces they inhabit, whether they be physical or sonic, and challenge the singularity of those spaces.",
   "Social Media Link": "https://www.audreyhirschman.com/",
   "Link to work": "https://drive.google.com/file/d/1pd3GAmnQJc77iGVLczcKG02kE_aIattd/view?usp=sharing",
   "filename": "audrey.jpg"
 },
 {
   "Name as you'd like it to appear": "Jayme Fiedler",
   "Title": "When Do I Become Enough?",
   "Materials": "Wood, steel, PVC",
   "Writing": "An exploration of ego. With this project, I’d like to explore the ways we discuss or understand our sense of self. How do we think of abundance in relation to absence? Are they independent from one another or can we feel them simultaneously? Who is deciding when we become enough?",
   "Social Media Link": "https://drive.google.com/file/d/1GiZWFY0SYGT6kdn0AzsZ3-vNCyB15wnZ/view?usp=sharing",
   "Link to work": "",
   "filename": "jayme.jpg"
 },
 {
   "Name as you'd like it to appear": "Michael Anderson",
   "Title": "Let Your Mind Run Wild",
   "Materials": "Cellophane, foam board, paint, silver tray, zines, crayons, pins, paper, table, chair",
   "Writing": "1. Sanitize the space and your hands\n2. Pick up one crayon, a miscellaneous marking utensil, or whatever other dry material you have on hand.\n3. Draw/write anything you want on the board.\n4. Additionally, you may grab a piece of paper and respond in the form of a free write. Write anything that's on your mind, but if you want direction I have many questions for you:\na. What answers do you need right now? \nb. How do you heal?\nc. What brings you hope?\nd. Do you have any questions for your community?\ne.What brings you joy?\nf. What does peace look like?\n11.Use a pin and add it to the wall. \n12. Discard the crayon/utensil in the bin below or take it with you.\n13.Take a zine, follow the qr code on the back, there is more waiting for you.\n",
   "Social Media Link": "https://www.instagram.com/myeklanderson/?hl=en",
   "Link to work": "https://drive.google.com/file/d/1m_ujpu_nyUmRGbv6aThKgwMmK6oQEJWP/view?usp=sharing",
   "filename": "michael.jpg"
 },
 {
   "Name as you'd like it to appear": "Valerie Thompson",
   "Title": "Masking ",
   "Materials": "Fabric from scrap bins and thrift stores, yarn, LED lights ",
   "Writing": "",
   "Social Media Link": "https://www.instagram.com/valaurarelart",
   "Link to work": "https://drive.google.com/file/d/1uXE36KdECR3zrMr76rESXwvJo_g5i5L7/view?usp=sharing",
   "filename": "valerie.jpg"
 },
 {
   "Name as you'd like it to appear": "Lethe Koenig",
   "Title": "We Are Living in a Man Made Hell",
   "Materials": "Chicken wire, paper mache, armature wire, acrylic paint, mdf board",
   "Writing": "",
   "Social Media Link": "",
   "Link to work": "https://drive.google.com/file/d/12YlvDRZSDcqpzWFWEt1OOJTxSGNTECuG/view?usp=sharing",
   "filename": "Lethe.jpg"
 }
]
